#encoding: utf-8

# 一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
# 假设该数为x ，
# x + 100 = n*n   x + 100 + 168 = m*m
# m*m - n*n = 168
# (m+n)(m-n) = 168
# m+n = i  m-n = j   i * j = 168  可得 i , j 之一为偶数或都为偶数
# m = (i+j)/2  n = (i-j)/2     可的 i , j 要么都是偶数，要么都是奇数。根据上一条可得 i , j 都为偶数
# 完全平方数不能为负数，所以 i , j
# i > j   1<j<i<85
for i in range(1,85):
    if 168%i == 0:
        j = 168 / i
        if i>j and (i+j)%2==0 and (i-j)%2==0:
            m = (i+j)/2
            n = (i-j)/2
            x = n*n - 100
            # print(m,n,x)
            print(x)